{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1000"}]}}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv1/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv2/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv2/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/fc2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv1/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv2/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv3/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv1/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv3/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv2/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/predictions/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}, {"size": "1000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv3/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv3/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/flatten/Const", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv1/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/fc1/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25088"}, {"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv2/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/fc1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv3/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/predictions/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv3/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv1/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/fc2/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}, {"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv1/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/vgg16/block1_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block1_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block1_conv1/Relu", "StatefulPartitionedCall/vgg16/block1_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block1_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block1_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vgg16/block1_conv2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block1_pool/MaxPool", "StatefulPartitionedCall/vgg16/block2_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block2_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block2_conv1/Relu", "StatefulPartitionedCall/vgg16/block2_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block2_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block2_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vgg16/block2_conv2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block2_pool/MaxPool", "StatefulPartitionedCall/vgg16/block3_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block3_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block3_conv1/Relu", "StatefulPartitionedCall/vgg16/block3_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block3_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block3_conv2/Relu", "StatefulPartitionedCall/vgg16/block3_conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block3_conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block3_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vgg16/block3_conv3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block3_pool/MaxPool", "StatefulPartitionedCall/vgg16/block4_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block4_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block4_conv1/Relu", "StatefulPartitionedCall/vgg16/block4_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block4_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block4_conv2/Relu", "StatefulPartitionedCall/vgg16/block4_conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block4_conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block4_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vgg16/block4_conv3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block4_pool/MaxPool", "StatefulPartitionedCall/vgg16/block5_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block5_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block5_conv1/Relu", "StatefulPartitionedCall/vgg16/block5_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block5_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block5_conv2/Relu", "StatefulPartitionedCall/vgg16/block5_conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block5_conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block5_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vgg16/block5_conv3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/vgg16/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/vgg16/block5_pool/MaxPool", "StatefulPartitionedCall/vgg16/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vgg16/fc1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/vgg16/flatten/Reshape", "StatefulPartitionedCall/vgg16/fc1/MatMul/ReadVariableOp", "StatefulPartitionedCall/vgg16/fc1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/vgg16/fc2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/vgg16/fc1/Relu", "StatefulPartitionedCall/vgg16/fc2/MatMul/ReadVariableOp", "StatefulPartitionedCall/vgg16/fc2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/vgg16/predictions/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/vgg16/fc2/Relu", "StatefulPartitionedCall/vgg16/predictions/MatMul/ReadVariableOp", "StatefulPartitionedCall/vgg16/predictions/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/vgg16/predictions/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/vgg16/predictions/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/vgg16/predictions/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of66.bin", "group1-shard2of66.bin", "group1-shard3of66.bin", "group1-shard4of66.bin", "group1-shard5of66.bin", "group1-shard6of66.bin", "group1-shard7of66.bin", "group1-shard8of66.bin", "group1-shard9of66.bin", "group1-shard10of66.bin", "group1-shard11of66.bin", "group1-shard12of66.bin", "group1-shard13of66.bin", "group1-shard14of66.bin", "group1-shard15of66.bin", "group1-shard16of66.bin", "group1-shard17of66.bin", "group1-shard18of66.bin", "group1-shard19of66.bin", "group1-shard20of66.bin", "group1-shard21of66.bin", "group1-shard22of66.bin", "group1-shard23of66.bin", "group1-shard24of66.bin", "group1-shard25of66.bin", "group1-shard26of66.bin", "group1-shard27of66.bin", "group1-shard28of66.bin", "group1-shard29of66.bin", "group1-shard30of66.bin", "group1-shard31of66.bin", "group1-shard32of66.bin", "group1-shard33of66.bin", "group1-shard34of66.bin", "group1-shard35of66.bin", "group1-shard36of66.bin", "group1-shard37of66.bin", "group1-shard38of66.bin", "group1-shard39of66.bin", "group1-shard40of66.bin", "group1-shard41of66.bin", "group1-shard42of66.bin", "group1-shard43of66.bin", "group1-shard44of66.bin", "group1-shard45of66.bin", "group1-shard46of66.bin", "group1-shard47of66.bin", "group1-shard48of66.bin", "group1-shard49of66.bin", "group1-shard50of66.bin", "group1-shard51of66.bin", "group1-shard52of66.bin", "group1-shard53of66.bin", "group1-shard54of66.bin", "group1-shard55of66.bin", "group1-shard56of66.bin", "group1-shard57of66.bin", "group1-shard58of66.bin", "group1-shard59of66.bin", "group1-shard60of66.bin", "group1-shard61of66.bin", "group1-shard62of66.bin", "group1-shard63of66.bin", "group1-shard64of66.bin", "group1-shard65of66.bin", "group1-shard66of66.bin"], "weights": [{"name": "StatefulPartitionedCall/vgg16/block1_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"min": -0.12521242347418093, "scale": 0.0010794174437429391, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32", "quantization": {"min": -0.03374725523605651, "scale": 0.00016462075724905614, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.23385101580152323, "scale": 0.0025697913824343213, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.09573267838534187, "scale": 0.0008782814530765309, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32", "quantization": {"min": -0.01468139892334447, "scale": 8.89781752929968e-05, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/fc2/BiasAdd/ReadVariableOp", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.03729792289874133, "scale": 0.0003453511379513086, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.17109864476849052, "scale": 0.001569712337325601, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32", "quantization": {"min": -0.0377859626622761, "scale": 0.0002798960197205637, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32", "quantization": {"min": -0.023528752530760623, "scale": 0.00012449075413100859, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.14754000718102733, "scale": 0.0010614389005829305, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32", "quantization": {"min": -0.04576151960839828, "scale": 0.00020706569958551258, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.14130993771786785, "scale": 0.000917596998167973, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"min": -0.14808768764430402, "scale": 0.0011304403636969772, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32", "quantization": {"min": -0.038418679772054445, "scale": 0.0002544283428612877, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32", "quantization": {"min": -0.05072504926253767, "scale": 0.0004335474295943391, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.14270655033635157, "scale": 0.0012302288822099274, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/predictions/MatMul/ReadVariableOp", "shape": [4096, 1000], "dtype": "float32", "quantization": {"min": -0.16314024741158767, "scale": 0.0008116430219481973, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv2/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32", "quantization": {"min": -0.043785462922909676, "scale": 0.00033681125325315137, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.16831781513550703, "scale": 0.001451015647719888, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv3/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32", "quantization": {"min": -0.04241299543018435, "scale": 0.0002602024259520512, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vgg16/block4_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"min": -0.10081647482572817, "scale": 0.0008766649984845928, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32", "quantization": {"min": -0.03858040959811678, "scale": 0.00039367764896037534, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/fc1/MatMul/ReadVariableOp", "shape": [25088, 4096], "dtype": "float32", "quantization": {"min": -0.14904952995917375, "scale": 0.0013074520171857348, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.11666413422893077, "scale": 0.0009259058272137362, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32", "quantization": {"min": -0.030812668814962984, "scale": 0.0002826850349996604, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/fc1/BiasAdd/ReadVariableOp", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.047811837757334996, "scale": 0.0003320266510926041, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.14025421878870797, "scale": 0.0011131287205453013, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/predictions/BiasAdd/ReadVariableOp", "shape": [1000], "dtype": "float32", "quantization": {"min": -0.026665440661942257, "scale": 0.00020670884234063764, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32", "quantization": {"min": -0.021154635750195556, "scale": 0.00015670100555700413, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.08434388006434722, "scale": 0.0007809618524476594, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/fc2/MatMul/ReadVariableOp", "shape": [4096, 4096], "dtype": "float32", "quantization": {"min": -0.12145108948735629, "scale": 0.0009638975356139389, "dtype": "uint8"}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32", "quantization": {"min": -0.03143522888422012, "scale": 0.0001849131110836478, "dtype": "uint8"}}]}]}